In [26]:
import sqlite3

Crear un obtejto "connection" para manejar base de datos, lo podemos crear o leer de bases de datos de formato SQL:

In [27]:
connection = sqlite3.connect("company.db")

en SQL se har√≠a tecleando "CREATE DATABASE company;"

In [28]:
cursor = connection.cursor()

In [33]:
#ingresar comando sql
sql_command = """
CREATE TABLE employee ( 
staff_number INTEGER PRIMARY KEY, 
fname VARCHAR(20), 
lname VARCHAR(30), 
gender CHAR(1), 
joining DATE,
birth_date DATE);"""
#ejecutar el comando en sql
cursor.execute(sql_command)

In [36]:
# delete 
#cursor.execute("""DROP TABLE employee;""")

In [34]:
sql_command = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
                 VALUES (NULL, "William", "Shakespeare", "m", "1961-10-25");"""

cursor.execute(sql_command)

In [35]:
sql_command = """INSERT INTO employee (staff_number, fname, lname, gender, birth_date)
    VALUES (NULL, "Frank", "Schiller", "m", "1955-08-17");"""
cursor.execute(sql_command)

In [37]:
# never forget this, if you want the changes to be saved:
connection.commit()

connection.close()

In [38]:
conn = sqlite3.connect("company.db")

In [39]:
cur = conn.cursor()

In [45]:
cur.execute("select * from employee limit 2;")

In [46]:
results = cur.fetchall()
print(results)

[(1, 'William', 'Shakespeare', 'm', None, '1961-10-25'), (2, 'Frank', 'Schiller', 'm', None, '1955-08-17')]

In [47]:
sql_command = """
CREATE TABLE boss ( 
staff_number INTEGER PRIMARY KEY, 
fname VARCHAR(20), 
lname VARCHAR(30), 
gender CHAR(1), 
joining DATE,
birth_date DATE);"""
#ejecutar el comando en sql
cur.execute(sql_command)

In [49]:
staff_data = [ ("Homer", "J. Simpson", "m", "1961-10-25"),
               ("Edgar", "Preciado", "m", "1955-08-17"),
               ("Paloma", "J. Simpson", "f", "1989-03-14") ]
               
for p in staff_data:
    format_str = """INSERT INTO boss (staff_number, fname, lname, gender, birth_date)
    VALUES (NULL, "{first}", "{last}", "{gender}", "{birthdate}");"""

    sql_command = format_str.format(first=p[0], last=p[1], gender=p[2], birthdate = p[3])
    cur.execute(sql_command)

In [51]:
conn.commit()

In [54]:
cur.execute("select * from boss limit 4;")
results = cur.fetchall()
print(results)

[(1, 'Homer', 'J. Simpson', 'm', None, '1955-05-05'), (2, 'Homer', 'J. Simpson', 'm', None, '1961-10-25'), (3, 'Edgar', 'Preciado', 'm', None, '1955-08-17'), (4, 'Paloma', 'J. Simpson', 'f', None, '1989-03-14')]

In [55]:
conn.close()

In [60]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("company.db")
cur = conn.cursor()
coords = cur.execute("""
select fname,
lname
from boss;""").fetchall()
print(coords)

[('Homer', 'J. Simpson'), ('Homer', 'J. Simpson'), ('Edgar', 'Preciado'), ('Paloma', 'J. Simpson')]

In [68]:
df = pd.read_sql_query("select * from boss limit 4;", conn)
df

   staff_number   fname       lname gender joining  birth_date
0             1   Homer  J. Simpson      m    None  1955-05-05
1             2   Homer  J. Simpson      m    None  1961-10-25
2             3   Edgar    Preciado      m    None  1955-08-17
3             4  Paloma  J. Simpson      f    None  1989-03-14

In [69]:
df.describe()

       staff_number
count      4.000000
mean       2.500000
std        1.290994
min        1.000000
25%        1.750000
50%        2.500000
75%        3.250000
max        4.000000

In [73]:
sql_command = """
CREATE TABLE dealers ( 
staff_number INTEGER PRIMARY KEY,
salario INTEGER NOT NULL,
fname VARCHAR(20), 
lname VARCHAR(30), 
gender CHAR(1), 
joining DATE,
birth_date DATE);"""
#ejecutar el comando en sql
cur.execute(sql_command)

OperationalError: table dealers already exists

In [75]:
staff_data = [ (2,5, "Homer", "J. Simpson", "m", "1961-10-25"),
               (3,7,"Edgar", "Preciado", "m", "1955-08-17"),
               (4,9,"Paloma", "J. Simpson", "f", "1989-03-14")]
               
for p in staff_data:
    format_str = """INSERT INTO dealers (staff_number,salario, fname, lname, gender, birth_date)
    VALUES ("{numero1}","{numero2}", "{first}", "{last}", "{gender}", "{birthdate}");"""

    sql_command = format_str.format(numero1=p[0],numero2=p[1],first=p[2], last=p[3], gender=p[4], birthdate = p[5])
    cur.execute(sql_command)

In [76]:
df1 = pd.read_sql_query("select * from dealers limit 4;", conn)
df1

   staff_number  salario   fname       lname gender joining  birth_date
0             2        5   Homer  J. Simpson      m    None  1961-10-25
1             3        7   Edgar    Preciado      m    None  1955-08-17
2             4        9  Paloma  J. Simpson      f    None  1989-03-14

In [77]:
df1.describe()

       staff_number  salario
count           3.0      3.0
mean            3.0      7.0
std             1.0      2.0
min             2.0      5.0
25%             2.5      6.0
50%             3.0      7.0
75%             3.5      8.0
max             4.0      9.0

In [81]:
df1.salario

0    5
1    7
2    9
Name: salario, dtype: int64

In [84]:
df1['salario'].value_counts()

7    1
9    1
5    1
Name: salario, dtype: int64

In [85]:
conn.commit()
conn.close()